// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let arrs = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
while (arrs[i]) {

}
// 2. перебрати його циклом for
for (let arr of arrs) {
    console.log(arr);
}
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// 6. перебрати циклом for та вивести  числа тільки парні  значення

// 7. замінити кожне число кратне 3 на слово "okten"

// 8. вивести масив в зворотньому порядку.

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)