// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let arrs = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let i = 0;
while (i<arrs.length) {
    console.log(arrs[i]);
    i++
}
// 2. перебрати його циклом for
for (let arr of arrs) {
    console.log(arr);
}
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
let x = 0;
while (x<arrs.length) {
    if (x%2 === 1){
    console.log(arrs[x]);
}
    x++
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (let j = 0; j < arrs.length; j++) {
    if (j%2 === 1) {
        console.log(arrs[j]);
    }
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
let h = 0;
while (h<arrs.length) {
    if (h%2 === 0) {
        console.log(arrs[h]);
    }
    h++
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
for (let n = 0; n < arrs.length; n++) {
    if (n%2 === 0) {
      console.log(arrs[n]);
    }
}
// 7. замінити кожне число кратне 3 на слово "okten"

// 8. вивести масив в зворотньому порядку.

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)