// Всі функції повинні бути описані стрілочним типом!!!!
// 1. створити функцію яка обчислює та повертає площу прямокутника
// 2. створити функцію яка обчислює та повертає площу кола
// 3. створити функцію яка обчислює та повертає площу циліндру
// 4. створити функцію яка приймає масив та виводить кожен його елемент
// 5. створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// 6. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// 7. створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// 8. створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// 9. створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.
// Для кожного об'єкту окремий блок.