// 1. Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone
// створити пустий масив, наповнити його 10 об'єктами new User(....)

// 2. Взяти масив з  User[] з попереднього завдання, та відфільтрувати ,
// залишивши тільки об'єкти з парними id (filter)

// 3. Взяти масив з  User[] з попереднього завдання, та відсортувати його по id. по зростанню (sort)

// 4. створити класс для об'єктів Client з полями id, name, surname , email, phone, order
// (поле є масивом зі списком товарів) створити пустий масив, наповнити його 10 об'єктами Client

// 5. Взяти масив (Client [] з попереднього завдання).
// Відсортувати його по кількості товарів в полі order по зростанню. (sort)

let user = {
    id: 1,
    name: 'kokos'
}
user.surname = 'abrikosov';
console.log(user);