// 1. Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// Потрібно зробити перевірку якщо кількість елементів у масиві більше або дорівнює 3,
// то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
(friends.length >= 3) ? console.log('це великий масив, в якому  3 і більше елементи') : console.log('це маленький масив');
// 2. Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше).
// Перевірити, чи знаходиться перше число між двома іншими.

// 3. Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
(a + b < 4) ? console.log('Мало') : console.log('Багато')
// 4. Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним,
// негативним або нулем. Напишіть це тернарним оператором
let number = prompt('Enter number from -100 to +100');
(number >=-100)