// 1. Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

// 2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let flat = prompt('Напишіть номер квартири');
if (flat <=0) {
     console.log('Такої квартири неіснує');
} else if (flat <=20) {
    console.log('Ця квартира знаходиться у першому підїзді');
} else if (flat <=48) {
    console.log('Ця квартира знаходиться у другому підїзді');
} else if (flat <=90) {
     console.log('Ця квартира знаходиться у третьому підїзді');
} else {
    console.log('Тут тільки 90 квартир');
}
// 3. Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = prompt('Задайте числове значення');
if (number == 10) {
    console.log('ВІРНО');
} else {
    console.log('НЕВІРНО');
}
// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
let x = prompt('Задайте значення змінній x');
if (x = )
// 5. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .