// 1. створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
function square(a,b) {
    return a*b;
}
console.log(square(30,40));
// 2. створити функцію яка обчислює та повертає площу кола з радіусом r
function sqrcircle(r) {
    return Math.PI * Math.pow(r,2);
}
console.log(sqrcircle(15));
// 3. створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function sqrcylinder(h,r) {
    return 2 * Math.PI * r * h;
}
console.log(sqrcylinder(50,10));
// 4. створити функцію яка приймає масив та виводить кожен його елемент

// 5. створити функцію яка створює параграф з текстом. Текст задати через аргумент

// 6. створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// 7. створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// 8. створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві),
// та будує для них список

// 9. створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.
// Для кожного об'єкту окремий блок.